https://www.youtube.com/watch?v=2vFu4YtzfgE

### Manipulating DataFrames with Pandas

In [2]:
import pandas as pd

<img src="loc_iloc_2.JPG" height="300" width="300" />

In [3]:
data = {'eggs':[47,110,221,77,132,205],'salt':[12,50,89,87,50,60],'spam':[17,31,72,20,52,55]}
df = pd.DataFrame(data,index=['Jan','Feb','Mar','Apr','May','Jun'])
df

     eggs  salt  spam
Jan    47    12    17
Feb   110    50    31
Mar   221    89    72
Apr    77    87    20
May   132    50    52
Jun   205    60    55

### Selecting a Column (i.e. Series)

In [4]:
df['eggs']

Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [5]:
type(df['eggs'])

pandas.core.series.Series

### Slicing and Indexing a Series

In [6]:
df['eggs'][1:4]       # Part of the eggs column

Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [7]:
df['eggs'][4]       # The value associated with May

132

### Using .loc[ ]

In [8]:
df.loc[:,'eggs':'salt']       # All rows, some columns

     eggs  salt
Jan    47    12
Feb   110    50
Mar   221    89
Apr    77    87
May   132    50
Jun   205    60

In [9]:
df.loc['Jan':'Apr',:]       # Some rows, All columns

     eggs  salt  spam
Jan    47    12    17
Feb   110    50    31
Mar   221    89    72
Apr    77    87    20

In [10]:
df.loc['Mar':'May','salt':'spam']

     salt  spam
Mar    89    72
Apr    87    20
May    50    52

#### Using lists rather than Slices

In [12]:
df.loc['Jan':'May',['eggs','spam']]

     eggs  spam
Jan    47    17
Feb   110    31
Mar   221    72
Apr    77    20
May   132    52

### Using iloc[ ]

In [11]:
df.iloc[2:5,1:]       # A block from middle of the DataFrame

     salt  spam
Mar    89    72
Apr    87    20
May    50    52

#### Using lists rather than Slices

In [13]:
df.iloc[[0,4,5],0:2]

     eggs  salt
Jan    47    12
May   132    50
Jun   205    60

### Series Vs Column DataFrame

<img src="loc_iloc_3.JPG" height="400" width="400" />

In [14]:
df['eggs']

Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [16]:
type(df['eggs'])

pandas.core.series.Series

In [15]:
df[['eggs']]

     eggs
Jan    47
Feb   110
Mar   221
Apr    77
May   132
Jun   205

In [17]:
type(df[['eggs']])

pandas.core.frame.DataFrame